{
    "version": "https://jsonfeed.org/version/1",
    "title": "Igor Montagner",
    "description": "",
    "home_page_url": "https://igordsm.github.io",
    "feed_url": "https://igordsm.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Igor Montagner"
    },
    "items": [
        {
            "id": "https://igordsm.github.io/livro-the-internet-con-how-to-seize-the-means-of-computation/",
            "url": "https://igordsm.github.io/livro-the-internet-con-how-to-seize-the-means-of-computation/",
            "title": "Livro &quot;The Internet Con: how to seize the means of computation&quot;",
            "summary": "Recentemente acabei de ler o livro “The Internet Con: how to seize the means of computation” por Cory Doctorow. O tema principal do livro é&hellip;",
            "content_html": "<p>Recentemente acabei de ler o livro <a href=\"https://www.versobooks.com/en-gb/products/3035-the-internet-con\">“The Internet Con: how to seize the means of computation”</a> por Cory Doctorow.</p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://www.versobooks.com/cdn/shop/files/getimage_f56a5b40-cc2c-496e-a798-9da52c436081.jpg?v=1690862906&width=584\" alt=\"\"  data-is-external-image=\"true\"></figure><p>O tema principal do livro é uma estratégia de negócios comumente usada nas principais Big Techs atualmente: criação de um produto baseado no <em>Efeito de Rede</em> e posterior aumento do <em>Custo de troca</em> para que os usuários continuem na plataforma mesmo após ela não ser tão vantajosa quanto no início.</p><p><em>Efeito de rede</em> é o nome dado a uma caracterísitca bem interessante de vários serviços online: quanto mais gente que você conhece usa maior é o valor que o serviço retorna a você. Note que a relação aqui é simétrica e até um tanto simbiótica: o fato de você usar também cria incentivos e benefícios para que os seus conhecidos usem (ou continuem usando) o serviço. Esse efeito não é negativo isoladamente, mas se torna complexo quando é aplicado em plataformas fechadas.</p><p>Isso nos leva ao segundo ponto do livro: <em>Custo de troca</em>. Ao fecharem cada vez mais suas plataformas e não permitirem interoperabilidade ou acessos via API essas plataformas aumentam o <em>Custo de trocar para um concorrente</em>. Aliado ao <em>Efeito de rede</em>, isso cria um ambiente não competitivo em que seria necessário levar grande parte dos seus contatos para o novo concorrente para continuar tendo os mesmos benefícios.</p><p>Segundo o autor, essa mistura leva a uma queda na utilidade dos serviços prestados: agora que os usuários estão presos na plataforma pode-se fazer o que quiser para aumentar seus lucros. Seria por isso que “todo mundo odeia Facebook/twitter mas não consegue parar de usar”. O principal argumento é que isso cria estruturas de poder com influência e dinheiro grandes demais para serem saudáveis para a sociedade (segundo o autor). </p><p>A solução proposta pela autor é a interoperabilidade dessas plataformas, mesmo que forçada por legislação ou via engenharia reversa. Os exemplos citados incluem reparos de telefones e até tratores, mas passam também por coisas mais cotidianas como programas de mensagens e redes sociais. A ideia geral é que toda a tecnologia que temos e usamos deveria ser acessível para reparos e usos sem restrições artificais de disponibilidade e/ou concorrência.</p><p>Algumas notícias recentes como a <a href=\"https://www.theverge.com/2023/12/13/24000120/threads-meta-activitypub-test-mastodon\">adoção de ActivityPub pelo Threads</a> ou da interop forçada do iMessage<a href=\"https://www.engadget.com/apple-confirms-it-has-blocked-imessage-exploit-012015485.html\">[1]</a><a href=\"https://www.engadget.com/beeper-mini-is-back-promising-imessage-access-on-android-if-you-sign-in-with-an-apple-id-182924774.html\">[2]</a> tornaram o livro mais relevante para mim. Gosto de tecnologias não tradicionais, então sempre comemoro quando esse tipo de movimento ocorre. Enfim, recomendo a leitura. Dá para ler fácil em um fim de semana e serve como introdução a vários assuntos legais de Web aberta e tecnologias alternativas. </p>",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
                   "livros"
            ],
            "date_published": "2024-10-15T20:42:18-03:00",
            "date_modified": "2024-10-15T20:42:18-03:00"
        },
        {
            "id": "https://igordsm.github.io/coisas-digitais-demais/",
            "url": "https://igordsm.github.io/coisas-digitais-demais/",
            "title": "Coisas digitais demais",
            "summary": "Meu armazenamento do Google está quase cheio e preciso decidir o que fazer com tantos dados que tenho. Comecei a tentar organizar meus dados e&hellip;",
            "content_html": "<p>Meu armazenamento do Google está quase cheio e preciso decidir o que fazer com tantos dados que tenho. Comecei a <strong>tentar</strong> organizar meus dados e notei que tenho coisas demais… Algumas das minhas coisas ainda estão no Dropbox, que eu parei de usar cotidianamente há algum tempo. Tudo do trabalho deveria ir para o OneDrive corporativo. Tenho dados pessoais no <a href=\"https://www.pcloud.com/\">pCloud</a> e também sincronizo algumas pastas usando <a href=\"https://syncthing.net/\">Syncthing</a>. Acho isso muito bagunçado e está ficando cansativo.</p><p>Percebi isso quando pensei em adotar o <a href=\"https://www.zotero.org\">Zotero</a> para organizar minhas leituras de papers e notei que teria que sincronizar com mais um serviço… Já está coisa demais para organizar! Isso sem os 4Gb emails arquivados no GMail que eu nunca mais vou usar nem meu backup do Whatsapp que ocupa quase 1Gb de… nada?</p><p>Acho isso cansativo. A ideia inicial do GMail e vários serviços do Google era boa: não precisa mais arquivar pois temos um baita sistema de busca e damos um monte de espaço grátis. Porém hoje percebo que isso não é tão legal assim…. Tem uma tonelada de dados produzidos que estão desorganizados e que desse jeito ficam sendo inúteis. E agora depois de anos guardando tudo dessa maneira criar algum sentido a partir disso é um trabalho enorme! </p><p>Não sei o que fazer com isso, mas percebi hoje e achei cansativo. No fim acaba sendo mais uma coisa para gerenciar na vida em um momento em que já tenho coisas demais para gerenciar. E nesse caso o ganho que tenho ao fazer isso não é claro. Não fazer incomoda, mas será que fazer só </p>",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
                   "reflexões"
            ],
            "date_published": "2024-10-05T21:24:52-03:00",
            "date_modified": "2024-10-05T21:24:52-03:00"
        },
        {
            "id": "https://igordsm.github.io/seminario-o-que-e-educacao-em-computacao-resultados-e-aprendizados-da-parceria-insper-uiuc/",
            "url": "https://igordsm.github.io/seminario-o-que-e-educacao-em-computacao-resultados-e-aprendizados-da-parceria-insper-uiuc/",
            "title": "Seminário &quot;O que é Educação em Computação? Resultados e aprendizados da parceria Insper-UIUC&quot;",
            "summary": "No dia 19/09 apresentei o seminário O que é Educação em Computação? Resultados e aprendizados da parceria Insper-UIUC na série de Seminários Acadêmicos da Engenheria.",
            "content_html": "<p>No dia 19/09 apresentei o seminário <strong>O que é Educação em Computação?  Resultados e aprendizados da parceria Insper-UIUC</strong> na série de Seminários Acadêmicos da Engenheria. Foi uma boa experiência organizar tudo o que fiz nos últimos anos e refletir um pouco sobre minha experiência. Estou deixando aqui nesta página os slides da apresentação e links para os papers que citei. </p><center>\n    <br>\n<embed src=\"https://igordsm.github.io/media/files/slides-seminario-2024.pdf\" width=\"500\" height=\"400\"></embed>\n</center>\n\n<p>Artigos citados:</p><ul>\n<li><a href=\"https://ieeexplore.ieee.org/abstract/document/9028687\">Teaching C programming in context: a joint effort between the Computer Systems, Embedded Computing and Programming Challenges courses</a></li>\n<li><a href=\"https://ieeexplore.ieee.org/abstract/document/9962662\">How much C can students learn in one week? Experiences teaching C in advanced CS courses</a></li>\n<li><a href=\"https://ieeexplore.ieee.org/abstract/document/9962744\">Learning professional software development skills by contributing to Open Source projects</a></li>\n<li><a href=\"https://dl.acm.org/doi/abs/10.1145/3626252.3630841\">Evaluating Mastery-oriented Grading in an Intensive CS1 Course</a></li>\n</ul>\n",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
                   "talks",
                   "pesquisa"
            ],
            "date_published": "2024-09-21T09:50:41-03:00",
            "date_modified": "2024-09-21T10:11:28-03:00"
        },
        {
            "id": "https://igordsm.github.io/meu-celular-e-bom-demais/",
            "url": "https://igordsm.github.io/meu-celular-e-bom-demais/",
            "title": "Meu celular é bom demais",
            "summary": "Ele tem absolutamente tudo o que preciso, mas acaba sendo bom até demais. Noto que nos dias que estou mais cansado ou ansioso meu uso&hellip;",
            "content_html": "<p>Ele tem absolutamente tudo o que preciso, mas acaba sendo bom até demais. Noto que nos dias que estou mais cansado ou ansioso meu uso aumenta. Por mais que eu não use Instagram, TikTok e afins, ainda fico ligado no WhatsApp e uso muio o Firefox para ler. YouTube é um problema em geral. O celular ficar apitando toda hora me irrita também, então deixo ele praticamente sempre no mudo (ou no modo vibrar). </p><p>Quando olho meu tempo de uso vejo que são, na maioria dos dias, mais de duas horas por dia. Posso contar o número de vezes que destravo a tela: pelo menos 40 vezes por dia. É coisa demais. Os principais “culpados” são <strong>Firefox</strong> e <strong>YouTube</strong>. Às vezes o tempo supera 4 horas de uso, mas em geral são quando eu assisti filmes ou séries no celular. Não considero esse tipo de uso um problema, já que em geral é um tempo de descanso bem aproveitado. </p><p>Até considerei deixar de ter um smartphone, na onda da galera do <a href=\"https://www.reddit.com/r/dumbphones/\">r/dumbphones</a>, mas ainda não cheguei nesse ponto. Quer dizer, já pesquisei uma infinidade de aparelhos minimalistas e muitas horas navegando em fórums. Só que isso não ajudou e só alimentou o problema, eu acho. </p><p>De qualquer maneira, minha lista de usos “essenciais” é meio curta:</p><ul>\n<li><strong>todo dia</strong> ouço música usando VLC</li>\n<li><strong>todo dia</strong> uso apps com Forest para registrar tempo de foco. </li>\n<li><strong>todo dia</strong> uso WhatsApp/Beeper para falar com minha família</li>\n<li><strong>todo dia</strong> uso Habitica para tentar melhorar meus hábitos</li>\n<li><strong>duas a três vezes por semana</strong> eu uso o Gympass para fazer exercícios em academias diversas</li>\n<li><strong>uma vez por semana</strong> uso o NewPipe para baixar músicas para ouvir offline</li>\n<li><strong>uma vez por semana</strong> uso algum app de navegação enquanto dirijo</li>\n<li><strong>mais ou menos uma vez por semana</strong> tiro fotos importantes com o smartphone. </li>\n<li><strong>uma ou duas vezes por mês</strong> preciso usar Zona Azul ou apps de pagamento de estacionamento</li>\n<li><strong>uma ou duas vezes por mês</strong> uso celular para guardar QRCode de eventos</li>\n</ul>\n<p><strong>YouTube</strong> está 0 relacionado com essas atividades. O NewPipe faz esse papel, mas como é um player anônimo não tem feed de recomendações para me atrapalhar. O <strong>Firefox</strong> até ajuda em algumas pesquisas durante uma emergência, mas também não está nas coisas que mais me beneficiam. </p><p>No próximo mês vou testar as Ferramentas de <a href=\"https://wellbeing.google/for-everyone/\">“Digital Wellbeing”</a>. Estou colocando limites bem mais estritos para esses dois apps: 30 minutos por dia para cada. Também deletei TODOS os ícones da minha tela inicial e deixei somente os dos apps acima. Também ativei a economia de energia, já que isso costuma ajudar a deixar menos apps inúteis acumulando. Se der certo conto aqui um pouco mais como isso aconteceu. </p>",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
                   "reflexões"
            ],
            "date_published": "2024-09-15T18:29:38-03:00",
            "date_modified": "2024-09-15T18:29:38-03:00"
        },
        {
            "id": "https://igordsm.github.io/reflexoes-sobre-participacoes-em-software-livre/",
            "url": "https://igordsm.github.io/reflexoes-sobre-participacoes-em-software-livre/",
            "title": "Reflexões sobre participações em software livre",
            "summary": "Durante a pandemia eu tive muitas contribuições aceitas para o ElementaryOS e isso foi uma das coisas que me motivou tanto a criar a eletiva&hellip;",
            "content_html": "<p>Durante a pandemia eu tive muitas contribuições aceitas para o <a href=\"https://elementary.io\">ElementaryOS</a> e isso foi uma das coisas que me motivou tanto a criar a eletiva de <a href=\"https://insper.github.io/open-dev\">Desenvolvimento Aberto</a> quanto a fazer uma  <a href=\"https://igordsm.github.io/palestra-na-python-brasil-2021/\">palestra na Python Brasil</a> e <a href=\"https://ieeexplore.ieee.org/abstract/document/9962744/\">publicar um artigo científico sobre o design da disciplina</a>. </p><p>Após um período afastado de software livre e bem cansativo no trabalho resolvi tentar voltar a fazer pequenas contribuições a projetos que gosto. E como eu realmente gosto de linguagens de programação, no fim foquei em coisas em <a href=\"https://nim-lang.org/\">Nim</a> e <a href=\"https://gleam.run\">Gleam</a>. Ambas tem comunidades pequenas e tem particularidades que as tornam únicas em comparação com linguagens mais “famosas”. </p><p>Quando testei <em>Nim</em> inicialmente gostei bastante por ser uma linguagem mais baixo nível, que compila para C e C++ mas também funciona em JS. Fazendo alguns experimentos topei na lib <a href=\"https://github.com/khchen/xl\">XL</a>, que é usada para ler arquivos Excel (<em>.xlsx</em>) e parecia funcionar bem… Tirando um bug bizarro que errava as datas em 1 ou 2 dias. Resolvi estudar formatos de datas e <a href=\"https://github.com/khchen/xl/pull/6\">fazer um PR</a>. E tive basicamente nenhuma resposta… até que depois de 6 meses o PR foi aceito sem nenhuma comentário ou discussão. </p><p>Minha experiência com <em>Gleam</em> já foi um pouco diferente. Comecei testando um wrapper de <a href=\"https://p5js.org/\">p5.js</a> que permitiria criar pequenos programas visuais e interativos no browser. O projeto <a href=\"https://github.com/Acepie/p5js_gleam/tree/main\">acepie/p5js_gleam</a> também é desenvolvido por somente uma pessoa, o que já me preocupou de novo. Como faltavam umas funções e constantes revolvi <a href=\"https://github.com/Acepie/p5js_gleam/issues/4\">abrir uma issue</a> e ver o que aconteceria. Em poucos dias <em>acepie</em> respondeu e já tinha adicionado as funções que faltavam. Fiquei contente pela responsividade e também pela sorte de ter alguém olhando o projeto. </p><p>As interações terem sido tão diferentes pode ter sido só acaso, mas para mim foi algo significativo. Em comunidades pequenas é comum que alguns projetos sejam meio “abandonados”, já que muito é mantido por somente uma pessoa e manter projetos é bem cansativo. Hoje eu tenho muito mais ânimo de usar <em>gleam</em> e tentar contribuir com a comunidade. Quando sair algum PR em <em>Gleam</em> eu conto aqui como foi. Enquanto isso o que me resta é me divertir com linguagens funcionais e tecnologias meio estranhas :)</p>",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
                   "reflexões"
            ],
            "date_published": "2024-09-09T19:46:00-03:00",
            "date_modified": "2024-09-09T19:57:44-03:00"
        },
        {
            "id": "https://igordsm.github.io/esse-blog-esta-dando-certo/",
            "url": "https://igordsm.github.io/esse-blog-esta-dando-certo/",
            "title": "Esse blog está &quot;dando certo&quot;?",
            "summary": "O que significa um blog \"dar certo\"? E este blog, o que significa ele estar \"cumprindo seu objetivo\"? Precisa de um? Estive pensando nisso nos&hellip;",
            "content_html": "\n  <p>\n    O que significa um blog \"dar certo\"? E este blog, o que significa ele estar \"cumprindo seu objetivo\"? Precisa de um? Estive pensando nisso nos ultimos dias e não tenho uma resposta, pra ser sincero.<br><br>Algumas pessoas usam blogs para contruir reputação. Quer dizer, usavam. Agora as pessoas postam no LinkedIn, em grande parte. E muitos são aqueles textos super formuláicos de gente tentando se vender como especialista. Acho chato e muito pouco autêntico. Teríamos um mundo MUITO melhor se todo mundo que posta coisas do tipo \"5 lições de vida que aprendi assistindo Harry Potter\" realmente aplicasse as 5 lições de vida (super genéricas) sobre as quais escreve. Eu gostaria muito de não ser essas pessoas. Não é que querer construir uma reputação seja ruim, mas se a maneira atual de fazer isso (com textos na internet) é com esse tipo de texto eu prefiro não focar em construir uma reputação.<br><br>De uma maneira mais básica, me parece que existirem pessoas que leem o blog seria uma boa medida. Por outro lado, não publico nada que seja realmente essencial em termos de conteudo. A maioria são textos de opinião em assuntos **bem específicos**. Por aqui não tem material de ensino nem coisas relacionadas à pesquisa. O blog é de teor inteiramente pessoal. Essencialmente, se eu deixar de escrever o blog nada de ruim acontece. É bem provável, inclusive, que ninguém note. <br><br>Aliás, eu me importo se ninguém lê os textos? É claro que eu gostaria de ter muitos visitantes todo mês, mas o ponto é outro. Senão tiver ninguém, isso vai me fazer mal? Hoje eu diria que não... Escrever aqui é uma forma de sair um pouco da rotina e de organizar coisas que faço e penso no meu cotidiano fora do trabalho. Como sou um pouco obsessivo, não falar e pensar em trabalho é difícil e o blog ajuda a reservar um tempinho para isso. Mais ainda: até agora eu não selecionei nenhuma ideia de texto pensando em quem poderia ler isso. <br><br>Talvez seja esse o ponto de um blog pessoal, no fim das contas. Escrever aqui me faz bem e isso basta. Mais do que isso deixaria de ser algo simples e passa a envolver querer otimizar e melhorar continuamente. Já faço isso em muitos outros momentos da vida. Não ter que fazer isso aqui é um alívio :)<br><br>\n  </p>",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
                   "reflexões"
            ],
            "date_published": "2024-08-26T20:09:25-03:00",
            "date_modified": "2024-09-09T19:56:18-03:00"
        },
        {
            "id": "https://igordsm.github.io/paper-no-sigcse-2024/",
            "url": "https://igordsm.github.io/paper-no-sigcse-2024/",
            "title": "Paper no SIGCSE 2024",
            "summary": "Título: Evaluating Mastery-oriented Grading in an Intensive CS1 Course pdf / ACM Digital Library Fiz a apresentação desse paper que fiz junto com o Rafael&hellip;",
            "content_html": "<p><strong>Título</strong>: Evaluating Mastery-oriented Grading in an Intensive CS1 Course <a href=\"https://zilles.cs.illinois.edu/papers/mastery_INSPER_SIGCSE_2024.pdf\">pdf</a> / <a href=\"https://dl.acm.org/doi/abs/10.1145/3626252.3630841\">ACM Digital Library</a></p><p>Fiz a apresentação desse paper que fiz junto com o Rafael Corsi e em parceria com Craig Zilles e Mariana Silva de Illinois. Foi o primeiro trabalho do Insper aprovado em uma conferência de educação tão boa e espero que tenhamos mais vários desse calibre :)</p><center>\n<embed src=\"https://igordsm.github.io/media/files/slides-sigcse-2024.pdf\" width=\"500\" height=\"400\"></embed>\n</center>\n\n",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
                   "talks",
                   "pesquisa"
            ],
            "date_published": "2024-08-20T20:02:00-03:00",
            "date_modified": "2024-08-20T20:02:00-03:00"
        },
        {
            "id": "https://igordsm.github.io/cansei-de-geradores-de-sites-estaticos/",
            "url": "https://igordsm.github.io/cansei-de-geradores-de-sites-estaticos/",
            "title": "Cansei de geradores de sites estáticos",
            "summary": "Eu já usei uma série quase incontável de programas do tipo jekyll, mkdocs e hugo. Esses SSG (static site generators)&nbsp;são os preferidos de desenvolvedores e&hellip;",
            "content_html": "\n  <p>\n    Eu já usei uma série quase incontável de programas do tipo jekyll, mkdocs e hugo. Esses SSG (<i>static site generators)</i>&nbsp;são os preferidos de desenvolvedores e entusiastas de tecnologia em geral. E eles também são ferramentas com uma usabilidade questionável. Você usar o editor que quiser! E também o tema que gostar mais, inclusive fazer o seu próprio! E ainda tem as novidades que saem a cada versão. Isso cria uma combinação enorme de situações que tem tudo a ver com tecnologia e são divertidas muitas vezes.&nbsp;\n  </p>\n\n  <p>\n    Nada contra gostar de configurar seu próprio ambiente e ter controle total sobre a tecnologia usada. Eu gosto disso. Mas com o tempo tenho percebido que às vezes eu só quero <b>tecnologia que não me atrapalhe</b>. Parece louco escrever isso explicitamente, mas é algo que tem sido comum para mim nos últimos tempos. Meu trabalho é exigente e tenho uma série atividades que gosto de fazer. Quando eu tenho tempo para escrever meus pensamentos aqui eu quero gastar meu tempo <b>escrevendo. </b>Não instalando pela enésima vez o ambiente para rodar jekyll. Ou descobrindo se o meu tema suporta alguma funcionalidade específica, já que a documentação é escarça e cada tema implementa o que quiser.&nbsp;\n  </p>\n\n  <p>\n    Então agora estou usando o <a href=\"https://getpublii.com/\" target=\"_blank\">Publii</a>, um gerenciador de conteúdo que gera um site estático que pode ser colocado no github pages ou AWS S3. Acabei de publicar o meu site clicando em um botão grande \"Publicar\" e não dando <i>git push </i>seguido de uma séria de comandos depois. Tudo integrado, fácil e sem grande dor de cabeça. O tema eu escolhi em um site do próprio software e instalar foi bem fácil. Vou ir usando aqui e vendo o que dá. Nas próximas semanas irei portar o conteúdo do site antigo para cá e ganhar mais experiência com isso. No limite é bem fácil de voltar para um SSG, mas acho que estou bem mais confortável ficando por aqui mesmo.&nbsp;\n  </p>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
            ],
            "date_published": "2024-08-17T17:14:14-03:00",
            "date_modified": "2024-08-17T17:21:44-03:00"
        },
        {
            "id": "https://igordsm.github.io/palestra-na-python-brasil-2021/",
            "url": "https://igordsm.github.io/palestra-na-python-brasil-2021/",
            "title": "Palestra na Python Brasil 2021",
            "summary": "Depois da última palestra acabei querendo repetir, e dessa vez falei sobre as contribuições de alunos na matéria Desenvolvimento Aberto no Insper. Foi bem gostoso&hellip;",
            "content_html": "\n  <p>\n    Depois da <a href=\"https://igordsm.github.io/palestra-na-python-brasil-2020/\">última palestra</a> acabei querendo repetir, e dessa vez falei sobre as contribuições de alunos na matéria Desenvolvimento Aberto no Insper. Foi bem gostoso também e me diverti bastante adaptando o material da disciplina para o evento.&nbsp;\n  </p>\n<div><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/mZnOf7BH4kY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>    \n\n\n\n</div>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
                   "talks"
            ],
            "date_published": "2024-08-15T19:03:11-03:00",
            "date_modified": "2024-08-15T19:03:11-03:00"
        },
        {
            "id": "https://igordsm.github.io/palestra-na-python-brasil-2020/",
            "url": "https://igordsm.github.io/palestra-na-python-brasil-2020/",
            "title": "Palestra na Python Brasil 2020",
            "summary": "No meio da pandemia resolvi fazer uma palestra na Python BR, a conferência nacional de Python. Como sou professor, acabei falando um pouco sobre fazer&hellip;",
            "content_html": "\n  <p>\n    No meio da pandemia resolvi fazer uma palestra na Python BR, a conferência nacional de Python. Como sou professor, acabei falando um pouco sobre fazer faculdade e gostei do resultado. A palestra agora está disponível online e acho que pode ainda ser interessante. Veja aí abaixo :)\n  </p>\n<div><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/yCXxcNnOFNY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>    </div>",
            "author": {
                "name": "Igor Montagner"
            },
            "tags": [
                   "talks"
            ],
            "date_published": "2020-08-15T18:33:00-03:00",
            "date_modified": "2024-08-15T18:36:21-03:00"
        }
    ]
}
